Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: [F] 403.3 Automatic sprinkler system.
fr_ca: [F] 403.3 Système d'extincteurs automatiques.

source: [F] 403.3.1 Number of sprinkler risers and system design.
fr_ca: [F] 403.3.1 Nombre de colonnes montantes d'extincteurs et conception du système.

source: [F] 403.3.1.1 Riser location.
fr_ca: [F] 403.3.1.1 Emplacement de la colonne montante.

source: [F] 403.3.2 Water supply to required fire pumps.
fr_ca: [F] 403.3.2 Alimentation en eau des pompes à incendie exigées.

source: [F] 403.3.3 Secondary water supply.
fr_ca: [F] 403.3.3 Alimentation en eau secondaire.

source: [F] 403.3.4 Fire pump room.
fr_ca: [F] 403.3.4 Salle des pompes à incendie.

source: [F] 403.4 Emergency systems.
fr_ca: [F] 403.4 Systèmes d'urgence.

source: [F] 403.4.1 Smoke detection.
fr_ca: [F] 403.4.1 Détection de fumée.

source: [F] 403.4.2 Fire alarm system.
fr_ca: [F] 403.4.2 Système d'alarme d'incendie.

source: [F] 403.4.3 Standpipe system.
fr_ca: [F] 403.4.3 Système de colonnes montantes.

source: [F] 403.4.4 Emergency voice/alarm communication system.
fr_ca: [F] 403.4.4 Système de communication vocale et d'alarme d'urgence.

source: [F] 403.4.5 Emergency communication coverage.
fr_ca: [F] 403.4.5 Couverture de communication d'urgence.

source: [F] 403.4.6 Fire command.
fr_ca: [F] 403.4.6 Centre de commandement en cas d'incendie.

source: [F] 403.4.7 Smoke removal.
fr_ca: [F] 403.4.7 Évacuation de la fumée.

source: [F] 403.4.8 Standby and emergency power.
fr_ca: [F] 403.4.8 Alimentation de secours et d'urgence.

source: [F] 403.4.8.1 Equipment room.
fr_ca: [F] 403.4.8.1 Salle d'équipement.

source: [F] 403.4.8.2 Fuel line piping protection.
fr_ca: [F] 403.4.8.2 Protection de la tuyauterie des conduites de carburant.

source: [F] 403.4.8.3 Standby power loads.
fr_ca: [F] 403.4.8.3 Charges d'alimentation de secours.

source: [F] 403.4.8.4 Emergency power loads.
fr_ca: [F] 403.4.8.4 Charges d'alimentation d'urgence.

source: [F] 404.3 Automatic sprinkler protection.
fr_ca: [F] 404.3 Protection par extincteurs automatiques.

source: [F] 404.4 Fire alarm system.
fr_ca: [F] 404.4 Système d'alarme d'incendie.

source: [F] 404.7 Standby power.
fr_ca: [F] 404.7 Alimentation de secours.

source: [F] 410.2.7.2 Smoke control.
fr_ca: [F] 410.2.7.2 Contrôle de la fumée.

source: [F] 410.6 Automatic sprinkler system.
fr_ca: [F] 410.6 Système d'extincteurs automatiques.

source: [F] 410.7 Standpipes.
fr_ca: [F] 410.7 Canalisations d’incendie.

source: [F] 802.3 Decorative materials and trim.
fr_ca: [F] 802.3 Matériaux décoratifs et éléments de finition.

source: [F] 806.1 General.
fr_ca: [F] 806.1 Généralités.

source: [F] 806.2 Combustible decorative materials.
fr_ca: [F] 806.2 Matériaux décoratifs combustibles.

source: [F] 806.4 Acceptance criteria and reports.
fr_ca: [F] 806.4 Critères d'acceptation et rapports.

source: [F] 806.5 Foam plastic.
fr_ca: [F] 806.5 Mousse plastique.

source: [F] 806.6 Pyroxylin plastic.
fr_ca: [F] 806.6 Plastique à base de pyroxyline.

source: [F] 806.7 Interior trim.
fr_ca: [F] 806.7 Éléments de finition intérieure.

source: [F] 806.8 Interior floor-wall base.
fr_ca: [F] 806.8 Base de mur intérieure.

source: [F] 806.9 Combustible lockers.
fr_ca: [F] 806.9 Casiers combustibles.

source: [F] 903.1 General.
fr_ca: [F] 903.1 Généralités.

source: [F] 903.1.1 Alternative protection.
fr_ca: [F] 903.1.1 Protection alternative.

source: [F] 903.2 Where required.
fr_ca: [F] 903.2 Endroits où ils sont exigés.

source: [F] 903.2.1 Group A.
fr_ca: [F] 903.2.1 Groupe A.

source: [F] 903.2.1.1 Group A-1.
fr_ca: [F] 903.2.1.1 Groupe A-1.

source: [F] 903.2.1.2 Group A-2.
fr_ca: [F] 903.2.1.2 Groupe A-2.

source: [F] 903.2.1.3 Group A-3.
fr_ca: [F] 903.2.1.3 Groupe A-3.

source: [F] 903.2.1.4 Group A-4.
fr_ca: [F] 903.2.1.4 Groupe A-4.

source: [F] 903.2.1.5 Group A-5.
fr_ca: [F] 903.2.1.5 Groupe A-5.

source: [F] 903.2.1.5.1 Spaces under grandstands or bleachers.
fr_ca: [F] 903.2.1.5.1 Espaces sous les tribunes ou les gradins.

source: [F] 903.2.1.6 Assembly occupancies on roofs.
fr_ca: [F] 903.2.1.6 Usages d’assemblée sur les toits.

source: [F] 903.2.10 Group S-2 parking garages.
fr_ca: [F] 903.2.10 Garages de stationnement, Groupe S-2.

source: [F] 903.2.10.1 Commercial parking garages.
fr_ca: [F] 903.2.10.1 Garages de stationnement commerciaux.

source: [F] 903.2.10.2 Mechanical-access enclosed parking garages.
fr_ca: [F] 903.2.10.2 Garages de stationnement encloisonnés à accès mécanique.

source: [F] 903.2.11 Specific building areas and hazards.
fr_ca: [F] 903.2.11 Aires de bâtiment et risques spécifiques.

source: [F] 903.2.11.1 Stories without openings.
fr_ca: [F] 903.2.11.1 Étages sans ouvertures.

source: [F] 903.2.11.1.1 Opening dimensions and access.
fr_ca: [F] 903.2.11.1.1 Dimensions des ouvertures et accès.

source: [F] 903.2.11.1.2 Openings on one side only.
fr_ca: [F] 903.2.11.1.2 Ouvertures sur un seul côté.

source: [F] 903.2.11.2 Rubbish and linen chutes.
fr_ca: [F] 903.2.11.2 Vide-ordures et vide-linge.

source: [F] 903.2.11.3 Buildings 55 feet or more in height.
fr_ca: [F] 903.2.11.3 Bâtiments d'une hauteur supérieure à 55 pieds.

source: [F] 903.2.11.4 Ducts conveying hazardous exhausts.
fr_ca: [F] 903.2.11.4 Conduits transportant des gaz d'échappement dangereux.

source: [F] 903.2.11.5 Commercial cooking operations.
fr_ca: [F] 903.2.11.5 Activités de cuisson commerciale.

source: [F] 903.2.2 Ambulatory care facilities.
fr_ca: [F] 903.2.2 Établissements de soins ambulatoires.

source: [F] 903.2.3 Group E.
fr_ca: [F] 903.2.3 Groupe E.

source: [F] 903.2.4 Group F-1.
fr_ca: [F] 903.2.4 Groupe F-1.

source: [F] 903.2.4.1 Woodworking operations.
fr_ca: [F] 903.2.4.1 Opérations de menuiserie.

source: [F] 903.2.4.2 Group F-1 distilled spirits.
fr_ca: [F] 903.2.4.2 Groupe F-1, spiritueux distillés.

source: [F] 903.2.4.3 Group F-1 upholstered furniture or mattresses.
fr_ca: [F] 903.2.4.3 Meubles rembourrés ou matelas du groupe F-1.

source: [F] 903.2.6 Group I.
fr_ca: [F] 903.2.6 Groupe I.

source: [F] 903.2.7 Group M.
fr_ca: [F] 903.2.7 Groupe M.

source: [F] 903.2.7.1 High-piled storage.
fr_ca: [F] 903.2.7.1 Stockage en hauteur.

source: [F] 903.2.7.2 Group M upholstered furniture or mattresses.
fr_ca: [F] 903.2.7.2 Meubles rembourrés ou matelas du groupe M.

source: [F] 903.2.8 Group R.
fr_ca: [F] 903.2.8 Groupe R.

source: [F] 903.2.8.1 Group R-3.
fr_ca: [F] 903.2.8.1 Groupe R-3.

source: [F] 903.2.8.2 Group R-4, Condition 1.
fr_ca: [F] 903.2.8.2 Groupe R-4, condition 1.

source: [F] 903.2.8.3 Group R-4, Condition 2.
fr_ca: [F] 903.2.8.3 Groupe R-4, Condition 2.

source: [F] 903.2.8.4 Care facilities.
fr_ca: [F] 903.2.8.4 Établissements de soins.

source: [F] 903.2.9 Group S-1.
fr_ca: [F] 903.2.9 Groupe S-1.

source: [F] 903.2.9.1 Repair garages.
fr_ca: [F] 903.2.9.1 Garages de réparation.

source: [F] 903.2.9.2 Bulk storage of tires.
fr_ca: [F] 903.2.9.2 Entreposage de pneus en vrac.

source: [F] 903.2.9.3 Group S-1 Distilled spirits or wine.
fr_ca: [F] 903.2.9.3 Groupe S-1 Boissons spiritueuses distillées ou vin.

source: [F] 903.2.9.4 Group S-1 upholstered furniture and mattresses.
fr_ca: [F] 903.2.9.4 Meubles rembourrés et matelas du groupe S-1.

source: [F] 907.1 General.
fr_ca: [F] 907.1 Généralités.

source: [F] 907.1.1 Construction documents.
fr_ca: [F] 907.1.1 Documents de construction.

source: [F] 907.1.2 Fire alarm shop drawings.
fr_ca: [F] 907.1.2 Plans d'atelier des systèmes d'alarme d'incendie.

source: [F] 907.1.3 Equipment.
fr_ca: [F] 907.1.3 Équipement.

source: [F] 907.2 Where required—new buildings and structures.
fr_ca: [F] 907.2 Lorsque requis — bâtiments et constructions neufs.

source: [F] 907.2.1 Group A.
fr_ca: [F] 907.2.1 Groupe A.

source: [F] 907.2.1.1 System initiation in Group A occupancies with an occupant load of 1,000 or more.
fr_ca: [F] 907.2.1.1 Déclenchement du système dans les usages du Groupe A dont la charge d'occupants est de 1 000 ou plus.

source: [F] 907.2.1.2 Emergency voice/alarm communication captions.
fr_ca: [F] 907.2.1.2 Légendes du système de communication vocale et d’alarme d’urgence.

source: [F] 907.2.2 Group B.
fr_ca: [F] 907.2.2 Groupe B.

source: [F] 907.2.2.1 Ambulatory care facilities.
fr_ca: [F] 907.2.2.1 Établissements de soins ambulatoires.

source: [F] 907.2.3 Group E.
fr_ca: [F] 907.2.3 Groupe E.

source: [F] 907.2.4 Group F.
fr_ca: [F] 907.2.4 Groupe F.

source: [F] 907.2.5 Group H.
fr_ca: [F] 907.2.5 Groupe H.

source: [F] 907.2.6 Group I.
fr_ca: [F] 907.2.6 Groupe I.

source: [F] 907.2.6.1 Group I-1.
fr_ca: [F] 907.2.6.1 Groupe I-1.

source: [F] 915.1 General.
fr_ca: [F] 915.1 Généralités.

source: [F] 915.1.1 Where required.
fr_ca: [F] 915.1.1 Endroits où elle est exigée.

source: [F] 915.1.2 Fuel-burning appliances and fuel-burning fireplaces.
fr_ca: [F] 915.1.2 Appareils à combustion et foyers à combustion.

source: [F] 915.1.3 Fuel burning, forced-air furnaces.
fr_ca: [F] 915.1.3 Appareils de chauffage à air pulsé à combustion.

source: [F] 915.1.4 Fuel-burning appliances outside of dwelling units, sleeping units and classrooms.
fr_ca: [F] 915.1.4 Appareils à combustion situés à l’extérieur des logements, des unités de couchage et des salles de classe.

source: [F] 915.1.5 Private garages.
fr_ca: [F] 915.1.5 Garages privés.

source: [F] 915.2 Locations.
fr_ca: [F] 915.2 Emplacements.

source: [F] 915.2.1 Dwelling units.
fr_ca: [F] 915.2.1 Logements.

source: [F] 915.2.2 Sleeping units.
fr_ca: [F] 915.2.2 Unités de couchage.

source: [F] 915.2.3 Group E occupancies.
fr_ca: [F] 915.2.3 Usages du groupe E.

source: [F] 915.4 Carbon monoxide alarms.
fr_ca: [F] 915.4 Alarme de monoxyde de carbone.

source: [F] 915.4.1 Power source.
fr_ca: [F] 915.4.1 Source d'alimentation.

source: [F] 915.4.2 Listings.
fr_ca: [F] 915.4.2 Homologations.

source: [F] 915.4.3 Locations.
fr_ca: [F] 915.4.3 Emplacements.

source: [F] 915.4.4 Combination alarms.
fr_ca: [F] 915.4.4 Alarmes combinées.

source: [F] 915.5 Carbon monoxide detection systems.
fr_ca: [F] 915.5 Systèmes de détection de monoxyde de carbone.

source: [F] 915.5.1 General.
fr_ca: [F] 915.5.1 Généralités.

source: [F] 915.5.2 Locations.
fr_ca: [F] 915.5.2 Emplacements.

source: [F] 915.5.3 Combination detectors.
fr_ca: [F] 915.5.3 Détecteurs combinés.

source: [F] 915.6 Maintenance.
fr_ca: [F] 915.6 Entretien.

source: [F] 916.1 Gas detection systems.
fr_ca: [F] 916.1 Systèmes de détection de gaz.

source: [F] 916.10 Fire alarm system connections.
fr_ca: [F] 916.10 Connexions du système d'alarme d'incendie.

source: [F] 916.11 Inspection, testing and sensor calibration.
fr_ca: [F] 916.11 Inspection, essais et étalonnage des capteurs.

source: [F] 916.2 Permits.
fr_ca: [F] 916.2 Permis.

source: [F] 916.2.1 Construction documents.
fr_ca: [F] 916.2.1 Documents de construction.

source: [F] 916.3 Equipment.
fr_ca: [F] 916.3 Équipement.

source: [F] 916.4 Power connections.
fr_ca: [F] 916.4 Connexions électriques.

source: [F] 916.5 Emergency and standby power.
fr_ca: [F] 916.5 Alimentation de secours et de réserve.

source: [F] 916.6 Sensor locations.
fr_ca: [F] 916.6 Emplacements des capteurs.

source: [F] 916.7 Gas sampling.
fr_ca: [F] 916.7 Échantillonnage de gaz.

source: [F] 916.8 System activation.
fr_ca: [F] 916.8 Activation du système.

source: [F] 916.9 Signage.
fr_ca: [F] 916.9 Signalisation.

source: [F] 917.1 College and university campuses.
fr_ca: [F] 917.1 Campus collégiaux et universitaires.

source: [P] 1210.1 Required fixtures.
fr_ca: [P] 1210.1 Installations requises.

source: [P] 1210.2 Finish materials.
fr_ca: [P] 1210.2 Matériaux de revêtement.

source: [P] 1210.2.1 Floors and wall bases.
fr_ca: [P] 1210.2.1 Planchers et plinthes murales.

source: [P] 1210.2.2 Walls and partitions.
fr_ca: [P] 1210.2.2 Murs et cloisons.

source: [P] 1210.2.3 Showers.
fr_ca: [P] 1210.2.3 Douches.

source: [P] 1210.2.4 Waterproof joints.
fr_ca: [P] 1210.2.4 Joints étanches.

source: [P] 1210.3 Privacy.
fr_ca: [P] 1210.3 Intimité.

source: [P] 1210.3.1 Water closet compartment.
fr_ca: [P] 1210.3.1 Compartiment de cabine de toilette.

source: [P] 1210.3.2 Urinal partitions.
fr_ca: [P] 1210.3.2 Cloisons d'urinoir.

source: “This is reproduced from 2018 International Building Code, the 2018 International Plumbing Code and ICC A117.1-2009 Standard and Commentary:
fr_ca: « Le présent document est reproduit à partir de l’International Building Code de 2018, de l’International Plumbing Code de 2018 et de la norme et du commentaire ICC A117.1-2009 :

source: “This is reproduced from 2021International RESIDENTIAL Code, International Code Council, Inc., Washington, D.C. Reproduced with permission.
fr_ca: « La version en anglais de ce document consiste en extraits de l'International RESIDENTIAL Code 2021, produit par l'International Code Council, inc., Washington, D.C., et utilisé avec leur permission.

source: The fire area exceeds 5,000 square feet (464 m2).
fr_ca: La zone d'incendie dépasse 5000 pi2 [464 m2].

source: 2.The ceiling height above bathroom and toilet room fixtures shall be such that the fixture is capable of being used for its intended purpose.
fr_ca: 2. La hauteur du plafond au-dessus des appareils sanitaires de la salle de bain et des toilettes doit être telle que l'appareil puisse être utilisé aux fins prévues.

source: A clear floor space complying with Section 305 shall be provided at call controls.
fr_ca: Une surface de plancher dégagée conforme à la section 305 doit être prévue au niveau des commandes d'appel.

source: A clearance of 48 inches (1220 mm) minimum in length measured perpendicular from the control wall, and 36 inches (915 mm) minimum in depth shall be provided adjacent to the open face of the compartment.
fr_ca: Il faut prévoir un dégagement d'au moins 48 po [1220 mm] en longueur, mesurée perpendiculairement au mur de commande, et d'au moins 36 po [915 mm] en profondeur, adjacent à la face ouverte du compartiment.

source: A vertical grab bar 18 inches (455 mm) minimum in length shall be provided on the control end wall 3 inches (75 mm) minimum and 6 inches (150 mm) maximum above the horizontal grab bar, and 4 inches (100 mm) maximum inward from the front edge of the shower.
fr_ca: Une barre d'appui verticale d'une longueur minimale de 18 po [455 mm] doit être prévue sur le mur du côté des commandes, à une hauteur comprise entre 3 po [75 mm] et 6 po [150 mm] au-dessus de la barre d'appui horizontale, et à une distance maximale de 4 po [100 mm] vers l'intérieur à partir du bord avant de la douche.

source: Accessible washing machines and clothes dryers shall comply with Section 611.
fr_ca: Les laveuses et les sécheuses accessibles doivent être conformes à la section 611.

source: An approved means of access shall be provided to elevator machine rooms, control rooms, control spaces and machinery spaces.
fr_ca: Un moyen d'accès approuvé doit être prévu pour les salles des machines d'ascenseur, les salles de commande, les espaces de commande et les espaces des machines.

source: An emergency two-way communication system shall be provided that:
fr_ca: Un système de communication bidirectionnel d'urgence doit être prévu qui :

source: Braille shall be contracted (Grade 2) braille and shall comply with Section 703.4.
fr_ca: Le braille doit être du braille abrégé (grade 2) et se conformer à la section 703.4.

source: Call buttons and keypads shall be located within one of the reach ranges specified in Section 308, measured to the centerline of the highest operable part.
fr_ca: Les boutons d'appel et les claviers doivent être situés dans l'une des plages de portée spécifiées à la section 308, mesurées jusqu'à la ligne médiane de la partie manœuvrable la plus haute.

source: Call buttons shall be 3/4 inch (19 mm) minimum in the smallest dimension.
fr_ca: Les boutons d'appel doivent avoir une dimension minimale de 3/4 po [19 mm] dans la plus petite dimension.

source: Changes in level greater than 1/2 inch (13 mm) in height shall be ramped and shall comply with Section 405 or 406.
fr_ca: Les changements de niveau d'une hauteur supérieure à 1/2 po [13 mm] doivent être en rampe et se conformer à la section 405 ou 406.

source: Changes in level greater than 1/4 inch (6.4 mm) in height and not more than 1/2 inch (13 mm) maximum in height shall be beveled with a slope not steeper than 1:2.
fr_ca: Les changements de niveau supérieurs à 1/4 po [6,4 mm] de hauteur et ne dépassant pas 1/2 po [13 mm] de hauteur maximale doivent être biseautés avec une pente d'au plus 1:2.

source: Changes in level in floor surfaces shall comply with Section 303.
fr_ca: Les changements de niveau dans les surfaces de plancher doivent être conformes à la section 303.

source: Changes in level of 1/4 inch (6.4 mm) maximum in height shall be permitted to be vertical.
fr_ca: Les changements de niveau d'une hauteur maximale de 1/4 po [6,4 mm] peuvent être verticaux.

source: Characters shall be uppercase.
fr_ca: Les caractères doivent être en majuscules.

source: Contaminant sources in naturally ventilated spaces shall be removed in accordance with the International Mechanical Code and the International Fire Code.
fr_ca: Les sources de contaminants dans les espaces naturellement ventilés doivent être éliminées conformément à l'International Mechanical Code et à l'International Fire Code.

source: Controls and hand showers shall comply with Sections 608.4 and 309.4.
fr_ca: Les commandes et les douches à main doivent être conformes aux sections 608.4 et 309.4.

source: Conveyors and conveying systems shall comply with ASME B20.1.
fr_ca: Les tapis roulants et les systèmes de transport doivent être conformes à la norme ASME B20.1.

source: Conveyors and related equipment connecting successive floors or levels shall be enclosed with shaft enclosures complying with Section 713.
fr_ca: Les convoyeurs et l’équipement connexe reliant des étages ou des niveaux successifs doivent être encloisonnés par des puits encloisonnés conformes à la section 713.

source: Doors, other than hoistway doors and the elevator car door, shall be prohibited at the point of access to an elevator car unless such doors are readily openable from the car side without a key, tool, special knowledge or effort.
fr_ca: Les portes autres que les portes de puits et la porte de cabine d’ascenseur sont interdites au point d’accès à une cabine d’ascenseur, à moins que ces portes puissent être facilement ouvertes du côté de la cabine sans clé, outil, connaissance particulière ou effort.

source: Each destination-oriented elevator in a bank of elevators shall have audible and visible means for differentiation.
fr_ca: Chaque ascenseur orienté vers la destination dans un groupe d'ascenseurs doit avoir des moyens sonores et visuels de différenciation.

source: Each required accessible means of egress shall be continuous to a public way and shall consist of one or more of the following components:
fr_ca: Chaque moyen d'évacuation accessible exigé doit être continu jusqu'à une voie publique et doit être composé d'un ou de plusieurs des éléments suivants :

source: Elevators shall not be in a common shaft enclosure with a stairway.
fr_ca: Les ascenseurs ne doivent pas être dans un puits encloisonné commun avec un escalier.

source: Escalator floor openings shall be enclosed with shaft enclosures complying with Section 713.
fr_ca: Les ouvertures de plancher des escaliers mécaniques doivent être encloisonnées par des puits encloisonnés conformes à la section 713.

source: Escalators, moving walks, conveyors, personnel hoists and material hoists shall comply with the provisions of Sections 3004.2 through 3004.4.
fr_ca: Les escaliers mécaniques, les trottoirs roulants, les convoyeurs, les monte-personnes et les élévateurs de matériaux doivent être conformes aux dispositions des sections 3004.2 à 3004.4.

source: Except as otherwise, provided for in this code, the design, construction, installation, alteration, repair and maintenance of elevators and conveying systems and their components shall conform to the applicable standard specified in Table 3001.3 and ASCE 24 for construction in flood hazard areas established in Section 1612.3.
fr_ca: Sauf disposition contraire du présent code, la conception, la construction, l’installation, la modification, la réparation et l’entretien des ascenseurs et des systèmes de transport vertical, ainsi que de leurs composants, doivent être conformes à la norme applicable indiquée au tableau 3001.3 et à la norme ASCE 24 pour les constructions situées dans les zones présentant un risque d’inondation établies à la section 1612.3.

source: Except as provided in Sections 2406.1.2 through 2406.1.4, all glazing shall pass the impact test requirements of Section 2406.2.
fr_ca: Sauf dans les cas prévus aux sections 2406.1.2 à 2406.1.4, tous les vitrages doivent satisfaire aux exigences relatives aux essais d’impact de la section 2406.2.

source: Exit access stairways that connect levels in the same story are not permitted as part of an accessible means of egress.
fr_ca: Des escaliers d'accès à l'issue qui relient des niveaux différents dans un même étage ne peuvent pas faire partie d'un moyen d'évacuation accessible.

source: Floor assemblies separating dwelling units in the same buildings, floor assemblies separating sleeping units in the same building and floor assemblies separating dwelling or sleeping units from other occupancies contiguous to them in the same building shall be constructed as horizontal assemblies in accordance with Section 711.
fr_ca: Les assemblages de plancher séparant des logements dans un même bâtiment, les assemblages de plancher séparant des unités de couchage dans un même bâtiment et les assemblages de plancher séparant des logements ou des unités de couchage d’autres usages contigus dans le même bâtiment doivent être construits comme des assemblages horizontaux conformément à la section 711.

source: Foyers that are not part of a hallway in accordance with Section E3901.10 and that have an area that is greater than 60 square feet (5.57 m2) shall have areceptacle(s) located in each wall space that is 3 feet (914 mm) or more in width.
fr_ca: Les foyers qui ne font pas partie d'un couloir selon la section E3901.10 et qui ont une superficie supérieure à 60 pi2 [5,57 m2] doivent avoir une ou plusieurs prises situées dans chaque espace mural d'une largeur de 3 pi [914 mm] ou plus.

source: Glass in elevator enclosures shall comply with Section 2409.2.
fr_ca: Le verre dans les cages d'ascenseur doit être conforme à la section 2409.2.

source: Glass-block walls shall comply with Section 2110.
fr_ca: Les murs en blocs de verre doivent être conformes à la section 2110.

source: Glazing in all fixed and operable panels of swinging, sliding and bifold doors shall be considered to be a hazardous location.
fr_ca: Le vitrage de tous les panneaux fixes et mobiles des portes battantes, coulissantes et pliantes doit être considéré comme un endroit dangereux.

source: Glazing in an individual fixed or operable panel adjacent to a door where the nearest vertical edge of the glazing is within a 24-inch (610 mm) arc of either vertical edge of the door in a closed position and where the bottom exposed edge of the glazing is less than 60 inches (1524 mm) above the walking surface shall be considered to be a hazardous location.
fr_ca: Les vitrages d’un panneau fixe ou mobile individuel adjacent à une porte, lorsque le bord vertical le plus proche du vitrage se trouve à l’intérieur d’un arc de 24 po (610 mm) de l’un ou l’autre des bords verticaux de la porte en position fermée et que le bord inférieur exposé du vitrage se trouve à moins de 60 po (1 524 mm) au-dessus de la surface de circulation, doivent être considérés comme étant situés dans un emplacement dangereux.
